app/controllers/characters_controller.rb

    def index
        # if params passed, filter, if not, no filter!
        if params[:series].blank?
            @characters = Character.all.order("created_at DESC")
        else
            @series_id = Series.find_by(name: params[:series]).id
            @characters = Character.where(:series_id => @series_id).order("created_at DESC")
---
SELECT "series".* FROM "series"
SELECT "characters".* FROM "characters" ORDER BY created_at DESC
SELECT  "series".* FROM "series" WHERE "series"."name" = ? LIMIT ?  [["name", "The Lord of the Rings"], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."series_id" = ? ORDER BY created_at DESC  [["series_id", 5]]

    def new
        # assigns new char to current user
        @character = current_user.characters.build
        # preps series
        @series = Series.all.map{ |s| [s.name, s.id] }
---
SELECT "series".* FROM "series" ORDER BY "series"."name" ASC

    def create
        # passes in created character
        @character = current_user.characters.build(character_params)
        @character.series_id = params[:series_id]
        if @character.save
---
INSERT INTO "characters" ("name", "description", "thoughts", "series", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Thom"], ["description", "Tom!"], ["thoughts", "He cool"], ["series", "The Wheel of Time"], ["created_at", "2017-11-28 17:19:13.964397"], ["updated_at", "2017-11-28 17:19:13.964397"]]

    def edit
        @series = Series.all.map{ |s| [s.name, s.id] }
---
SELECT "series".* FROM "series" ORDER BY "series"."name" ASC

    def update
        @character.series_id = params[:series_id]
        if @character.update(character_params)
---
UPDATE "characters" SET "name" = ?, "description" = ?, "thoughts" = ?, "series" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["name", "hvjhgksdfsdf"], ["description", "sdfsdfsdfsdf"], ["thoughts", "sdfsdfsdfsdfsdf"], ["series", "sdfsdfsdfsdf"], ["updated_at", "2017-11-28 17:38:36.979013"], ["id", 4]]

    def destroy
        @character.destroy
---
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 2]]

    def find_book
        @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]